from faker import Faker


faker = Faker('ru_RU')

def generate_random_user_data():
    name = faker.first_name()
    surname = faker.last_name()
    street = faker.street_name()
    house = faker.random_int(1, 999)
    address = f"{street}, {house}"
    phone = '+7' + faker.numerify('###########')
    date_obj = faker.future_datetime(end_date="+30d")
    date = date_obj.strftime("%d.%m.%Y")
    comment = faker.text(max_nb_chars=10)
    return name, surname, address, phone, date, comment


class AccordionData:
    answers = [
        'Сутки — 400 рублей. Оплата курьеру — наличными или картой.',
        'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.',
        'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.',
        'Только начиная с завтрашнего дня. Но скоро станем расторопнее.',
        'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.',
        'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.',
        'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.',
        'Да, обязательно. Всем самокатов! И Москве, и Московской области.'
]
